---
kind: method
id: M:Autodesk.Revit.DB.Plumbing.IPipePlumbingFixtureFlowServer.GetInformationLink
source: html/949c6ccf-f009-77eb-2ce8-ca6c3860e0bf.htm
---
# Autodesk.Revit.DB.Plumbing.IPipePlumbingFixtureFlowServer.GetInformationLink Method

The method that Revit will invoke to obtain a URL address which provides more information about the server.

## Syntax (C#)
```csharp
string GetInformationLink()
```

## Returns
The URL providing server information.